AccumulationRegisters/ПозицииИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ПозицииИнструментов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ФинансовыеРезультатыПоСделкам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ФинансовыеРезультатыПоСделкам</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Выручка</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Себестоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комиссия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрибыльУбыток</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Портфель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтратегияСделки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтратегииСделок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ТекущиеЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ТекущиеЦены</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака8</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиДанных</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>lastPriceType</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Инструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonForms/ms_ФормаСостояниеПортфеля/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФинансовыеПоказатели = ФинансовыеПоказатели();
	СтоимостьПортфеля = ФинансовыеПоказатели.СтоимостьОстаток;
	РеализованныйPnLЗаМесяц = ФинансовыеПоказатели.ПрибыльУбытокЗаМесяц;
	РеализованныйPnLСначалаГода = ФинансовыеПоказатели.ПрибыльУбытокСНачалаГода;
	НереализованныйPnL = ФинансовыеПоказатели.НереализованныйPnL;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодключитьОбработчикОжидания("ОбновитьФинРез", 60, Истина);
	
КонецПроцедуры

&НаСервере
Функция ФинансовыеПоказатели()
	
	Результат = Новый Структура("СтоимостьОстаток, ПрибыльУбытокЗаМесяц, ПрибыльУбытокСНачалаГода, НереализованныйPnL");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПозицииИнструментовОстатки.СтоимостьОстаток КАК СтоимостьОстаток
		|ИЗ
		|	РегистрНакопления.ПозицииИнструментов.Остатки КАК ПозицииИнструментовОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФинансовыеРезультатыПоСделкамОбороты.ПрибыльУбытокОборот КАК ПрибыльУбытокОборот
		|ИЗ
		|	РегистрНакопления.ФинансовыеРезультатыПоСделкам.Обороты(&ДатаНачала, , Период, ) КАК ФинансовыеРезультатыПоСделкамОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ФинансовыеРезультатыПоСделкамОбороты.ПрибыльУбытокОборот КАК ПрибыльУбытокОборот
		|ИЗ
		|	РегистрНакопления.ФинансовыеРезультатыПоСделкам.Обороты(&ДатаНачалаГода, , Период, ) КАК ФинансовыеРезультатыПоСделкамОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ПозицииИнструментовОстатки.КоличествоОстаток * ЕСТЬNULL(ТекущиеЦеныСрезПоследних.Цена, 0) - ПозицииИнструментовОстатки.СтоимостьОстаток) КАК НереализованныйPnL
		|ИЗ
		|	РегистрНакопления.ПозицииИнструментов.Остатки КАК ПозицииИнструментовОстатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТекущиеЦены.СрезПоследних КАК ТекущиеЦеныСрезПоследних
		|		ПО ПозицииИнструментовОстатки.Инструмент = ТекущиеЦеныСрезПоследних.Инструмент";
	
	Запрос.Параметры.Вставить("ДатаНачала", ДобавитьМесяц(ТекущаяДатаСеанса(), -1));
	Запрос.Параметры.Вставить("ДатаНачалаГода", НачалоГода(ТекущаяДатаСеанса()));
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка= РезультатЗапроса[0].Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.СтоимостьОстаток = Выборка.СтоимостьОстаток;
	КонецЕсли;
	
	Выборка= РезультатЗапроса[1].Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.ПрибыльУбытокЗаМесяц = Выборка.ПрибыльУбытокОборот;
	КонецЕсли;
	
	Выборка= РезультатЗапроса[2].Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.ПрибыльУбытокСНачалаГода = Выборка.ПрибыльУбытокОборот;
	КонецЕсли;

	Выборка= РезультатЗапроса[3].Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат.НереализованныйPnL = Выборка.НереализованныйPnL;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СтоимостьПортфеля

&НаКлиенте
Процедура ОбновитьФинРез() Экспорт

	ФинансовыеПоказатели = ФинансовыеПоказатели();
	СтоимостьПортфеля = ФинансовыеПоказатели.СтоимостьОстаток;
	РеализованныйPnLЗаМесяц = ФинансовыеПоказатели.ПрибыльУбытокЗаМесяц;
	РеализованныйPnLСначалаГода = ФинансовыеПоказатели.ПрибыльУбытокСНачалаГода;
	
	ПодключитьОбработчикОжидания("ОбновитьФинРез", 60, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОтчетФинРез(ЗаПериод)
	
	Если ЗаПериод = "СНачалаГода" Тогда
		НачалоПериода = НачалоГода(ТекущаяДата());
	ИначеЕсли ЗаПериод = "ЗаМесяц" Тогда
		НачалоПериода =  ДобавитьМесяц(ТекущаяДата(), -1);
	Иначе
		НачалоПериода = Неопределено;
	КонецЕсли;
	УсловияОтбора = Новый Структура("НачалоПериода, КонецПериода", НачалоПериода, ТекущаяДата());
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", УсловияОтбора, Истина);
	ОткрытьФорму("Отчет.ФинРез.ФормаОбъекта", ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура РеализованныйPnLСначалаГодаНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьОтчетФинРез("СНачалаГода");
КонецПроцедуры

&НаКлиенте
Процедура РеализованныйPnLЗаМесяцНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьОтчетФинРез("ЗаМесяц");
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьПортфеляНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Неопределено, Истина);
	ОткрытьФорму("Отчет.ПозицииНаДату.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура НереализованныйPnLНажатие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ПараметрыФормы = Новый Структура("Отбор, СформироватьПриОткрытии", Неопределено, Истина);
	ОткрытьФорму("Отчет.Портфель.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры
